package com.app.sjkh.commons.vo;

/**
 * Created by zhangweikang on 2016/8/11.
 */
public enum ResultCode {

	HBEC_000000("000000","成功"),
	HBEC_001001("001001","数据重复"),
	HBEC_001002("001002","系统离线状态"),
	HBEC_001003("001003","系统异常"),
	HBEC_001004("001004","参数不完整"),
	HBEC_001005("001005","失败"),
	HBEC_001006("001006","查询结果为空"),
	HBEC_001007("001007","未知状态"),
	HBEC_001008("001008","请求参数转换失败"),
	HBEC_001009("001009","事务未回滚"),
	HBEC_001010("001010", "调用其它系统异常"),
	HBEC_999999("999999","其他异常"),

	HBEC_001011("001011","用户未注册"),
	HBEC_001012("001012","用户已注册"),
	HBEC_001013("001013","touker注册成功"),
	HBEC_001014("001014","touker注册失败"),

	HBEC_001015("001015","已绑定三方存管"),
	HBEC_001016("001016","未绑定三方存管"),
	HBEC_001017("001017","已绑定三方支付"),
	HBEC_001018("001018","未绑定三方支付"),
	HBEC_001020("001020","未绑定三方支付,未绑定三方存管"),

	HBEC_001021("001021","身份证已过期"),
	HBEC_001022("001022","身份证已上传"),
	HBEC_001023("001023","身份证已使用"),
	HBEC_001024("001024","需要重新上传身份证"),
	HBEC_001025("001025","不需要重新上传身份证"),
	HBEC_001026("001026","已在投客上传身份证"),

	HBEC_001027("001027","交易密码验证通过"),
	HBEC_001028("001028","交易密码验证失败"),

	HBEC_001029("001029","钱钱数据校验,新开户(首次开户)"),
	HBEC_001030("001030","钱钱数据校验,未提交(继续开户)"),
	HBEC_001031("001031","钱钱数据校验,待审核正常"),
	HBEC_001032("001032","钱钱数据校验,待审核已驳回"),
	HBEC_001033("001033","钱钱数据校验,已开户(失败)"),
	HBEC_001034("001034","钱钱数据校验,已开户(成功)"),

	HBEC_001035("001035","非交易时间"),
	HBEC_001036("001036","交易时间"),

	HBEC_001037("001037","超出查询范围"),

	HBEC_001038("001038","您的验证码已经过期,请重新点击发送按钮"),
	HBEC_001039("001039","您的验证码输入错误,请重新点击发送按钮"),

	HBEC_001040("001040","用户驳回"),

	HBEC_001041("001041","开户流程已走完"),
	HBEC_001042("001042","开户流程未走完"),

	HBEC_001043("001043","同一身份证号,用户输入与投客不一致"),
	HBEC_001044("001044","暂不支持改身份证股票开户"),

	HBEC_001045("001045","短信发送失败"),
	HBEC_001046("001046","短信输入有误")
	;
	private String code;
	private String memo;

	private ResultCode(String code, String memo) {
		this.code = code;
		this.memo = memo;
	}

	public String getCode() {
		return code;
	}
	public void setCode(String code) {
		this.code = code;
	}
	public String getMemo() {
		return memo;
	}
	public void setMemo(String memo) {
		this.memo = memo;
	}
}
